#### Import relevant libraries

In [1]:
import numpy as np
import pandas as pd

#### Load dataset

In [2]:
marketing_data = pd.read_csv("data/marketing_campaign.csv")

#### Subset for relevant columns

In [3]:
marketing_data = marketing_data[['ID', 'Year_Birth', 'Education', 'Marital_Status']]

#### Take sample from dataset

In [4]:
marketing_data = marketing_data[:5]

#### Inspect first 5 rows and shape of the dataset

In [5]:
marketing_data

     ID  Year_Birth   Education Marital_Status
0  5524        1957  Graduation         Single
1  2174        1954  Graduation         Single
2  4141        1965  Graduation       Together
3  6182        1984  Graduation       Together
4  5324        1981         PhD        Married

In [6]:
marketing_data.shape

(5, 4)

####  Delete a specified rows at index values 1

In [7]:
marketing_data.drop(labels=[1], axis=0)

     ID  Year_Birth   Education Marital_Status
0  5524        1957  Graduation         Single
2  4141        1965  Graduation       Together
3  6182        1984  Graduation       Together
4  5324        1981         PhD        Married

#### Delete a single column

In [8]:
marketing_data.drop(labels=['Year_Birth'], axis=1)

     ID   Education Marital_Status
0  5524  Graduation         Single
1  2174  Graduation         Single
2  4141  Graduation       Together
3  6182  Graduation       Together
4  5324         PhD        Married